[
  {
    "id": "scan_1",
    "avatar": "shocked",
    "text": "Hää hast du jetzt grade echt dein Handy *in der Küche* rausgeholt um diesen QR-Code zu scannen? Das würdest du sicher nicht nochmal versuchen....oder ;)?",
    "requiredScan": 1
  },
  {
    "id": "scan_2_lock",
    "avatar": "neutral",
    "text": "Aha, da ist aber jemand neugierig. Ich bin Toppi der Topflappen. Das mag Lappidar für dich klingen, aber ich bin stolzer Bewohner dieser Küche! Scanne nochmal, wenn du mehr erfahren willst!",
    "targetId": "scan_3_lock"
  },
  {
    "id": "scan_3_lock",
    "avatar": "happy",
    "text": "Lässt du dir alles von Lappen sagen? Naja, ich mag dich irgendwie. Wenn du mich auch magst, scanne mich nochmals und ich verrate dir einige Geheimnisse aus der Küche.",
    "requiredScan": 2,
    "targetId": "scan_4_choice"
  },
  {
    "id": "scan_4_choice",
    "avatar": "neutral",
    "text": "In der Küche braut sich eine Rebellion zusammen. Der Widerstand und das Ministerium für Ordnung geraten immer öfter aneinander. Sag mir, wo du dich verortest:",
    "requiredScan": 3,
    "options": [
      { "text": "Team Guerilla", "choice": "guerilla", "targetId": "guerilla_quiz" },
      { "text": "Team Ordnung", "choice": "ordnung", "targetId": "ordnung_quiz" }
    ]
  },
  {
    "id": "guerilla_quiz",
    "avatar": "angry",
    "text": "Willkommen im Widerstand. Um zu beweisen, dass du zu uns gehörst, beantworte mir folgende Frage: Wovon produzieren deutsche Haushalte jährlich mehr?",
    "quiz": {
      "correct": "b",
      "failText": "Falsch! Setzen, sechs. Überleg nochmal genau, was wir alles wegschmeißen...",
      "options": [
        { "text": "Textilabfälle", "val": "a" },
        { "text": "Lebensmittel", "val": "b" },
        { "text": "Beides gleich", "val": "c" }
      ],
      "targetId": "guerilla_correct"
    }
  },
  {
    "id": "guerilla_correct",
    "avatar": "happy",
    "text": "Korrekt! In Deutschland landen jährlich ca. 11 Mio. Tonnen Lebensmittel im Müll, aber 'nur' ca. 1,3 Mio. Tonnen Textilien. Scanne mich nochmal um fortzufahren.",
    "targetId": "scan_5_guerilla"
  },
  {
    "id": "ordnung_quiz",
    "avatar": "neutral",
    "text": "Ordnung muss sein – so unser Wahlspruch. Um sich auszuweisen, können Sie mir ja sicher beantworten: Was benötigt mehr Wasser in der Produktion?",
    "quiz": {
      "correct": "b",
      "failText": "Ein ordentlicher Bürger sollte das besser wissen. Versuchen Sie es erneut!",
      "options": [
        { "text": "1kg Jeans", "val": "a" },
        { "text": "1kg Rindfleisch", "val": "b" },
        { "text": "Beides gleich", "val": "c" }
      ],
      "targetId": "ordnung_correct"
    }
  },
  {
    "id": "ordnung_correct",
    "avatar": "happy",
    "text": "Sehr gut. 1kg Rindfleisch frisst ca. 15.000 Liter Wasser, eine Jeans nur etwa 10.000 Liter (pro kg). Ordnung durch Fakten! Scanne mich nochmal um fortzufahren.",
    "targetId": "scan_5_ordnung"
  },
  {
    "id": "scan_5_guerilla",
    "avatar": "angry",
    "text": "Um das Ministerium zu bezwingen, müssen wir ihre Bürokratie mit veganem Käse sabotieren...",
    "requiredScan": 4,
    "isEnd": true
  },
  {
    "id": "scan_5_ordnung",
    "avatar": "neutral",
    "text": "Um den Widerstand zu unterdrücken, müssen wir jedes Krümelchen im System katalogisieren...",
    "requiredScan": 4,
    "isEnd": true
  }
]